# файлы с разными переходными текстами

pagolenok = '''

Паголенок

Когда выполнен наборный ряд и связана манжета, можно приступать к паголенку. Он, как правило, вяжется без увеличения и уменьшения количества петель в круговых рядах. На этой части носка много свободного места, что позволяет проявить фантазию. Будь то структурные, ажурные узоры, с косами или многоцветные — воображение не знает границ, а при небольшом объеме носка можно попробовать даже более сложные приемы. Именно так иногда возникают маленькие произведения вязального искусства со сложными узорами паголенка.
В зависимости от типа рисунка необходимо учитывать разные особенности, потому что узоры могут быть более эластичными или плотными. Полотно, связанное из пряжи секционного крашения обычной лицевой гладью, уже очень нарядное.
Считается, что длина паголенка должна быть равна длине среднего пальца руки. Этот старинный совет актуален и сегодня. Однако надо при этом учитывать свои пожелания
и назначение носков. Так, у носков, которые вы будете носить с сапогами, паголенок должен быть выше, чем у летних. Высота будет также зависеть от узора и его раппорта. Часто приходится провязать один или два дополнительных сантиметра, чтобы завершить рисунок при переходе к пятке.

'''