# Пятки

heels_dict = {
    # Пятка с закруглением, образованным тремя частями
    'three_part_rounded_heel': '''

Пятка с закруглением, образованным тремя частями

Такая пятка — это классика, известная практически всем. Она очень проста в исполнении и может быть надежно усилена несколькими способами.

Стенка
Отложите петли верхней части стопы, переведите петли пятки на одну спицу и свяжите стенку лицевой гладью. При этом кромочные петли провязывайте жемчужной вязкой. Правильная высота стенки будет тогда, когда на обоих краях окажется вдвое меньше жемчужин, чем петель пятки, или столько, сколько петель на одной спице. Завершите пятку в середине лицевого ряда.

Закругление
Закругление провязывается только на средних петлях пятки. Для этого разделите все петли на три части: две равные боковые и среднюю. Если число петель не делится на 3 без остатка, лишние петли всегда прибавляйте к средней части. Распределение петель для всех размеров дано в таблицах ниже. Число между косыми чертами (/) указывает количество петель в средней части, два крайних — количество петель двух боковых частей.
ПРИ ВЯЗАНИИ НА КРУГОВЫХ СПИЦАХ три части сначала можно отделить маркерами петель. Когда вы сделаете первые сокращения петель, соответствующие точки будут хорошо видны даже без маркировки.
При вязании на чулочных спицах отложенные петли верхней части стопы переведите на одну спицу, чтобы получить свободную. Тогда на обеих сторонах стенки пятки двумя свободными спицами можно набрать соответствующее число петель. Петли боковых частей находятся на отдельных чулочных спицах, средняя часть связана наполовину. Закругление выполняют только петлями средней части.
1-й ряд (1/2 лиц. ряда): провязать лицевой гладью, при этом последнюю петлю средней части снять, как при лицевом вязании, свободную спицу отложить в сторону, снять также первую петлю боковой части, затем обе петли провязать вместе лицевой с наклоном влево и повернуть работу.
2-й ряд: (изн. ряд): первую петлю снять отложенной спицей, как при изнаночном вязании, петли средней части провязать изнаночными. Последнюю петлю средней части снять, освободившуюся спицу отложить, снятую петлю надеть на спицу

'''
}