# Подошва

sole_dict = {
    # Гладкая подошва
    'smooth_sole': '''

Гладкая подошва

Если паголенок был выполнен без рисунка лицевой гладью, то обычно верхнюю часть стопы и подошву делают тоже гладкими. Если же паголенок связан определенным узором, после завершения пятки можно вязать двумя способами. Первый: узор после пятки не продолжают,
а стопу вяжут круговыми рядами лицевой гладью. Второй: узор продолжают на верхней части стопы. Подумать об этом надо при распределении петель пятки, чтобы позже рисунок был симметрично расположен сверху. Для верхней части стопы не стоит выбирать плотные рельефные, структурные узоры или с шишечками, так как они могут давить на ногу в обуви. Но петли стопы
в любом случае должны быть провязаны лицевой гладью.

'''
}