# Виды наборов петель на спицы

type_stich_list = [
    'Классический перекрсётный набор',
    'Эластичный перекрёстный набор',
]
stich_dict = {
    'cross_classic': '''
Классический перекрестный набор

Для классического перекрестного набора перед начальной петлей нужно оставить конец нити длиной не менее чем втрое больше обхвата манжеты носка.
1. Спицу с начальной петлей возьмите в правую руку, набросив рабочую нить на вытянутый указательный палец, а ее конец — на вытянутый большой палец левой руки. Обе нити придерживайте левыми средним и безымянным пальцами и мизинцем. Спицу с начальной петлей поместите в середину натянутой нити между большим и указательным пальцами.
2. Введите спицу под переднюю нить на большом пальце.
3. Захватите рабочую нить на указательном пальце.
4. Протяните рабочую нить под нить на большом пальце.

''',


}
# elastic_cross = '''Эластичный перекрестный набор
# При эластичном перекрестном наборе
# у манжеты нет жестко- го края. Таким спосо- бом удобно набирать петли, если надо связать носки на полную ногу.
# 1. При эластичном перекрестном наборе необходимо набирать вдвое больше петель, чем в классическом варианте. Длина конца нити при этом должна быть больше обхвата носка минимум в шесть раз.
# 2. В первом поворотном или круговом ряду в узоре, выбранном для вязания манжеты, провяжите по две петли вместе, чтобы уменьшить их число до необходимого.
# '''
# strong_cross = None
# two_color_cross = None
# entwined_cross = None
# cord_like_cross = None
# norwegian = None
# node = None
# nabor_s_ryushami = None
# two_color = None
# italian_without_support = None
# italian_with_support = None

# # тут ещё с десяток различных наборов
# pass
