# Мысок

toe_dict = {
    # Ленточный мысок
    'tape_toe': '''

Ленточный мысок

Ленточный мысок считается абсолютной классикой. Своим характерным внешним видом с боковыми полосками он обязан убавлениям с наклоном вправо и влево. Количество промежуточных рядов всегда уменьшается по направлению к мыску, что позволяет образовать красивое закругление.

Круговой ряд с убавлениями для ленточного мыска
Все петли вяжите лицевыми, при этом вторую и третью петли от конца на первой и третьей спицах провязывайте вместе лицевой с наклоном вправо, а вторую и третью петли второй и четвертой спиц снимайте, как при лицевом вязании, и провязывайте вместе с наклоном влево. Этот круговой ряд с убавлениями повторяйте через определенный интервал, а между ними вяжите промежуточные ряды без убавлений. Длина рядов становится все меньше по направлению к концу носка. Описание для каждого размера дано в таблицах.

'''
}